/*==============================================================================

   頂点管理[polygon.h]
														 Author :
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/
#pragma once


#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************


////////////////
//構造体
////////////////


class BumpMapField
{
	public:
		XMFLOAT3	Position;
		XMFLOAT3	Scale;
		XMFLOAT3	Rotate;
		int			TexID;
		int			BumpTexID;	// バンプマップのテクスチャID
};







//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitBumpMapField(void);
void FinalizeBumpMapField(void);
void UpdateBumpMapField(void);
void DrawBumpMapField(void);

